{"posts":[{"title":"detection","text":"","link":"/detection/"},{"title":"About Me","text":"Personal Information Name: Shikang Pang Contact: shikangpang@hotmail.com Who am IHello, my name is Shikang Pang, a master’s graduate in Computer Science and Technology from Henan University. Currently, I am a Software Development Engineer at Xiaomi, focusing on applying large language models to code assistance. I am passionate about solving complex problems through technology and have extensive experience in full-stack development and large language models. During my studies, I specialized in graph anomaly detection, and I have also co-founded two startups, gaining valuable project and management experience. Career Change Henan University Major: Computer Science and Technology Degree: Master’s Degree Graduation Year: 2024 About This SiteCitations Xiaomi CorporationPosition: Software Development EngineerDuration: July 2024 - Present Focused on the practical application of large language models, handling full-stack development and model-related tasks. I actively follow the latest advancements in large models, conducting research to inform product development. Contributed to the development of tools like code review systems, programming assistants, and document optimization. Contact Me Two Startups Software Development Company: Served educational institutions and government departments, gaining experience in team management and interpersonal communication. Script Murder Store: Gained experience in customer service and physical business operations.","link":"/"},{"title":"OpenAI GPT Models","text":"IntroductionOpenAI Generative Pre-trained Transformer (GPT) models are a series of transformer architecture based language models trained on a large corpus of text data to generate human-like text developed by OpenAI. Since the rise of transformer model, OpenAI has been continuing on the track of optimizing the GPT models using larger and better datasets, improved neural network modules, human supervision and assistance, and other innovations. As of 2023, the latest GPT model, ChatGPT, has become the most popular application in the world that helps the users solving problems in different specialized domains. In this article, I would like to discuss the evolution of OpenAI GPT models and their technical details. PrerequisitesThere are a couple of prerequisites for understanding the GPT evolution, including the transformer model, language modeling, and natural language processing task specific fine-tuning. TransformerThe transformer model is the key neural network architecture for the OpenAI GPT models. To learn the transformer model, if you have not done so, please read my previous article “Transformer Explained in One Single Page” for transformer basics and “Transformer Autoregressive Inference Optimization” for in-depth understanding of the transformer decoder autoregressive decoding process.","link":"/articles/OpenAI%20GPT%20Models/"},{"title":"Sobel Operator","text":"","link":"/blog/Sobel%20Operator/"},{"title":"论知足常乐","text":"","link":"/essays/%E8%AE%BA%E7%9F%A5%E8%B6%B3%E5%B8%B8%E4%B9%90/"},{"title":"life","text":"","link":"/life/life/"},{"title":"百年孤独","text":"前言","link":"/readings/%E7%99%BE%E5%B9%B4%E5%AD%A4%E7%8B%AC/"}],"tags":[{"name":"Deep Learning","slug":"Deep-Learning","link":"/tags/Deep-Learning/"},{"name":"Inference Optimization","slug":"Inference-Optimization","link":"/tags/Inference-Optimization/"},{"name":"Transformer","slug":"Transformer","link":"/tags/Transformer/"},{"name":"GPT","slug":"GPT","link":"/tags/GPT/"},{"name":"OpenAI","slug":"OpenAI","link":"/tags/OpenAI/"},{"name":"ChatGPT","slug":"ChatGPT","link":"/tags/ChatGPT/"},{"name":"ACCELERATED COMPUTING","slug":"ACCELERATED-COMPUTING","link":"/tags/ACCELERATED-COMPUTING/"}],"categories":[{"name":"articles","slug":"articles","link":"/articles/"},{"name":"blog","slug":"blog","link":"/blog/"},{"name":"essays","slug":"essays","link":"/essays/"},{"name":"life","slug":"life","link":"/life/"},{"name":"readings","slug":"readings","link":"/readings/"}],"pages":[{"title":"Curriculum Vitae","text":"Personal Information Name: Shikang Pang Contact: shikangpang@hotmail.com SummaryHello, my name is Shikang Pang, a master’s graduate in Computer Science and Technology from Henan University. Currently, I am a Software Development Engineer at Xiaomi, focusing on applying large language models to code assistance. I am passionate about solving complex problems through technology and have extensive experience in full-stack development and large language models. During my studies, I specialized in graph anomaly detection, and I have also co-founded two startups, gaining valuable project and management experience. Education Henan University Major: Computer Science and Technology Degree: Master’s Degree Graduation Year: 2024 Project Experience Xiaomi Programming AssistantAn intelligent programming assistant developed based on large language models, providing functionalities such as code generation, completion, automatic commenting, translation, and intelligent Q&amp;A. This tool enhances developer productivity significantly, supporting major programming languages and multiple mainstream IDEs. I worked on full-stack development, model deployment, and fine-tuning using technologies like Kotlin, LLM, Python, and Node.js. Achievements include: Code Acceptance Rate: Increased from 11% to 18% through model fine-tuning and prompt engineering. Response Time Improvement: Reduced from 5 tps to 2 tps via model pruning and FlashAttention. Usage: All department employees use this tool. Xiaomi Document ExpertA lightweight Chrome extension that uses large language models to generate and complete documents, provide suggestions, and optimize content. This tool enhances document editing capabilities significantly. Employee Usage: 80% of company employees use this tool, averaging 1 hour per day. I led the research, development, and full-stack engineering efforts to improve user experience. Work Experience Xiaomi CorporationPosition: Software Development EngineerDuration: July 2024 - Present Focused on the practical application of large language models, handling full-stack development and model-related tasks. I actively follow the latest advancements in large models, conducting research to inform product development. Contributed to the development of tools like code review systems, programming assistants, and document optimization. Entrepreneurial Experience Two Startups Software Development Company: Served educational institutions and government departments, gaining experience in team management and interpersonal communication. Script Murder Store: Gained experience in customer service and physical business operations. Interests Reading: Psychology, English Academic Journals Coding: Full Stack Development, Large Language Models Psychology Services KBS Journal Reviewer (2023 - Now) I review KBS Main Journal papers annually. SkillsProgramming Language I often program using Java and Python. I also have experiences in programming using Scala, C++, MATLAB, JavaScript and have done at least one large project for each of them. Machine Learning and Deep Learning Natural Language Processing, Graph Neural Networks, Computer Vision, Statistical Methods, Optimization Methods. Office Suites I am very proficient in writing LaTeX and Markdown. Personal StatementI am an engineer passionate about challenges and continuous growth, with a strong ability to learn and collaborate. I used to enjoy exploring a variety of interests, but recently I have found an ideal I want to pursue—conducting research in psychology and contributing to the field of psychology. My work at Xiaomi and entrepreneurial ventures have provided me with extensive project development and management expertise, and I remain committed to technical excellence. My current research focuses on large language models and algorithmic advancements. I am active in the open-source community and hope to contribute to technological innovation, creating value for the company and society.","link":"/curriculum/index.html"},{"title":"publications","text":"Graph Detection@Henan UniversityJournal Articles Counterfactual Data Augmentation With Denoising Diffusion for Graph Anomaly DetectionC. Xiao, S. Pang, X. Xu, X. Li, G. Trajcevski and F. ZhouIEEE Transactions on Computational Social Systems IEEE Xplore Controlled graph neural networks with denoising diffusion for anomaly detectionXuan Li; Chunjing Xiao; Ziliang Feng; Shikang Pang; Wenxin Tai; Fan ZhouExpert Systems with Applications Science Direct Conference Articles Graph Anomaly Detection with Diffusion Model-Based Graph Enhancement (Student Abstract)Shikang Pang, Chunjing Xiao, Wenxin Tai, Zhangtao Cheng and Fan ZhouProceedings of the AAAI Conference on Artificial IntelligenceAAAI Motif-Consistent Counterfactuals with Adversarial Refinement for Graph-level Anomaly DetectionChunjing Xiao, Shikang Pang, Wenxin Tai, Yanlong Huang, Goce Trajcevski, and Fan Zhou.Proceedings of the 30th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD ‘24).ACM","link":"/publications/index.html"},{"title":"projects","text":"","link":"/projects/index.html"}]}